<a href="https://colab.research.google.com/github/UtkarshaZade/DMW/blob/main/Ass1_Data_Handling_and_preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
print('hello')

hello

Data preprocessing assignent of dmw

In [ ]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import StandardScaler, MinMaxScaler

In [ ]:
list = { 'Name' : ['Ram', 'Ayush', 'Vijay','Arya', 'Arav', 'Ayush'],
        'Fruit' : ['Apple', 'Banana13', 'Grapes', None, 'Pineapple', 'Banana13'],
         'Salary' : [20000, 60000, None, 120000, 10000, 60000],
         'Age' : [18, 40, 29, None , 90, 40]
}

data = pd.DataFrame(list)
print(data)

    Name      Fruit    Salary   Age
0    Ram      Apple   20000.0  18.0
1  Ayush   Banana13   60000.0  40.0
2  Vijay     Grapes       NaN  29.0
3   Arya       None  120000.0   NaN
4   Arav  Pineapple   10000.0  90.0
5  Ayush   Banana13   60000.0  40.0

In [ ]:
data.duplicated()
data.drop_duplicates(inplace=True)
print(data)

    Name      Fruit    Salary   Age
0    Ram      Apple   20000.0  18.0
1  Ayush   Banana13   60000.0  40.0
2  Vijay     Grapes       NaN  29.0
3   Arya       None  120000.0   NaN
4   Arav  Pineapple   10000.0  90.0

Are there any null values and if yess then remove them

In [ ]:
data.dtypes

Name       object
Fruit      object
Salary    float64
Age       float64
dtype: object

In [ ]:
data.isnull()
data.isnull().sum()

Name      0
Fruit     1
Salary    1
Age       1
dtype: int64

In [ ]:
# for col age
data['Age'].fillna(data['Age'].mean(), inplace=True)
# for col salary
data['Salary'].replace(np.nan, 0, inplace=True)
print(data)

    Name      Fruit    Salary    Age
0    Ram      Apple   20000.0  18.00
1  Ayush   Banana13   60000.0  40.00
2  Vijay     Grapes       0.0  29.00
3   Arya       None  120000.0  44.25
4   Arav  Pineapple   10000.0  90.00

/tmp/ipython-input-7-3056475514.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Age'].fillna(data['Age'].mean(), inplace=True)
/tmp/ipython-input-7-3056475514.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Salary'].replace(np.nan, 0, inplace=True)

In [ ]:
data['Age'] = data['Age'].astype(int)

In [ ]:
print(data)

    Name      Fruit    Salary  Age
0    Ram      Apple   20000.0   18
1  Ayush   Banana13   60000.0   40
2  Vijay     Grapes       0.0   29
3   Arya       None  120000.0   44
4   Arav  Pineapple   10000.0   90

In [ ]:
data['Fruit'].fillna(data['Fruit'].mode(), inplace=True)
print(data)

    Name      Fruit    Salary  Age
0    Ram      Apple   20000.0   18
1  Ayush   Banana13   60000.0   40
2  Vijay     Grapes       0.0   29
3   Arya  Pineapple  120000.0   44
4   Arav  Pineapple   10000.0   90

/tmp/ipython-input-10-3515289231.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Fruit'].fillna(data['Fruit'].mode(), inplace=True)

In [ ]:
data.isnull().sum()

Name      0
Fruit     0
Salary    0
Age       0
dtype: int64

Normalize

In [ ]:
scaler = MinMaxScaler()
data['Salary'] = scaler.fit_transform(data[['Salary']])
print(data)

    Name      Fruit    Salary  Age
0    Ram      Apple  0.166667   18
1  Ayush   Banana13  0.500000   40
2  Vijay     Grapes  0.000000   29
3   Arya  Pineapple  1.000000   44
4   Arav  Pineapple  0.083333   90

In [ ]:
data['Age'] = scaler.fit_transform(data[['Age']])
print(data)

    Name      Fruit    Salary       Age
0    Ram      Apple  0.166667  0.000000
1  Ayush   Banana13  0.500000  0.305556
2  Vijay     Grapes  0.000000  0.152778
3   Arya  Pineapple  1.000000  0.361111
4   Arav  Pineapple  0.083333  1.000000